Autodesk.Revit.DB.ColumnAttachment.SetJustification(Autodesk.Revit.DB.ColumnAttachmentJustification)
Setter of ColumnAttachmentJustification
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ColumnAttachment.RemoveColumnAttachment(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.ElementId)
Removes any attachment of the column to the specified target.
Remarks:
This method modifies both column and target elements.
column:
A column.
targetId:
Id of a target element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ColumnAttachment.RemoveColumnAttachment(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Removes an attachment at the top or base of a column, if there is one.
Remarks:
This method modifies both column and target elements.
column:
A column.
baseOrTop:
0 for base, 1 for top.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
baseOrTop must be either 0 or 1.

Autodesk.Revit.DB.ColumnAttachment.GetColumnAttachment(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.ElementId)
Look up a column attachment by specifying the target id.
Remarks:
May return either a top or base attachment.
column:
A column.
targetId:
Id of a target element.
Returns:
The column attachment attaching the column to the target, or null if there
is no such attachment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ColumnAttachment.GetColumnAttachment(Autodesk.Revit.DB.FamilyInstance,System.Int32)
Look up a column attachment. There is at most one attachment on
the base and one on the top.
column:
A column.
baseOrTop:
0 for base, 1 for top.
Returns:
The column attachment for the base or top of the column, or null if that end
of the column is unattached.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
baseOrTop must be either 0 or 1.

Autodesk.Revit.DB.ColumnAttachment.AddColumnAttachment(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.Element,System.Int32,Autodesk.Revit.DB.ColumnAttachmentCutStyle,Autodesk.Revit.DB.ColumnAttachmentJustification,System.Double)
Attaches the column to the target. If an attachment already
exists with the same "baseOrTop" value, no attachment is made.
Remarks:
This method modifies both column and target elements.
doc:
The document containing column and target.
column:
A column.
target:
A target element.
baseOrTop:
0 to attach the column base, 1 to attach the column top.
cutColumnStyle:
Control the handling of columns that intersect their targets.
justification:
Control the column extent in cases where the target is not a uniform height.
attachOffset:
An additional offset for the bottom. If positive, the column base or top will
be higher than the attachment point; if negative, lower.
Throws Autodesk.Revit.Exceptions.ArgumentException:
column is not a column that supports ColumnAttachments.
-or-
target is not a valid target for ColumnAttachments.
-or-
column already has an attachment at its base or top as specified by baseOrTop.
-or-
column already has an attachment to target.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
baseOrTop must be either 0 or 1.
-or-
The given value for attachOffset must be no more than 30000 feet in absolute value.
-or-
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.ColumnAttachment.IsValidTarget(System.Boolean,Autodesk.Revit.DB.Element)
Says whether the element can be used as a target for a new attachment.
Remarks:
Valid targets are roofs, floors, ceilings, levels. Beams and braces
are valid targets, except for slanted columns.
forSlantedColumn:
If true, check whether the target is valid for a slanted column;
if false, check whether the target is valid for a vertical column.
target:
A proposed target element for a column attachment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ColumnAttachment.IsValidTarget(Autodesk.Revit.DB.FamilyInstance,Autodesk.Revit.DB.Element)
Says whether the element can be used as a target for a new attachment.
Remarks:
Valid targets are roofs, floors, and ceilings. Beams and braces
are also valid targets, except for slanted columns.
column:
The column to attach. If the target is a beam or brace, the column
will be checked to see if it is slanted. Otherwise, this argument
is not used and may be omitted.
target:
A proposed target element for a column attachment.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ColumnAttachment.IsValidColumn(Autodesk.Revit.DB.FamilyInstance)
Says whether a FamilyInstance supports column attachments.
Remarks:
In-place columns do not support attachments.
familyInstance:
A column.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.ColumnAttachment.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ColumnAttachment.CutStyle
Identifies whether the column, or the attached element should be cut (or if neither should be cut).

Autodesk.Revit.DB.ColumnAttachment.Justification
Identifies the type of justification to apply to this ColumnAttachment.

Autodesk.Revit.DB.ColumnAttachment.BaseOrTop
Identifies if this ColumnAttachment is at the base or top of the column.

Autodesk.Revit.DB.ColumnAttachment.TargetId
The id of the element that is attached to the column and is described by this ColumnAttachment.

Autodesk.Revit.DB.ColumnAttachment.AttachOffset
The offset of the column attachment.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for attachOffset must be no more than 30000 feet in absolute value.

Autodesk.Revit.DB.ColumnAttachment
An object representing the attachment of the top or bottom of a column to some target:
a floor, roof, ceiling, beam, or brace.
Remarks:
Call IsValidColumn() and IsValidTarget() to verify that specific elements support
column attachments. A column has at most one top attachment and one bottom
attachment.